{
    "data": [
        {
            "id": 19,
            "postCategory": "Desarrollo Web",
            "postTitle": "Ytat: una aplicación web full stack, con Gatsby-Netlify en el front-end y Strapi-Heroku en el back-end",
            "postSubtitle": "PRIMER CENSO MUNDIAL DE PERSONAS RELACIONADAS CON EL TANGO ARGENTINO",
            "slug": "yo-tambien-amo-el-tango",
            "postedOn": "17 de Agosto de 2020",
            "author": "GuilleHM",
            "postImage": "ytat.png",
            "postText": "Aplicación web, con interfaz en español e inglés, que pretende establecer un censo a nivel mundial de personas relacionadas con el tango, lo que permitirá a cualquier persona física u organización que quiera promocinar su difusión, obtener datos con los que respaldar sus iniciativas ante las administraciones públicas o entidades privadas desde las que se pretenda recabar apoyo, pudiendo así mostrarles cuán numerosa y diversa es esta comunidad.<br></br>El frontal de la aplicación está creado con GATSBY, incluyendo elementos como: la opción de alternar, sin tener que recargar la página y por, ende, con una transición casi inmediata, entre español e inglés como el idioma de presentación; un mapa interactivo que permite obtener una primera impresión del número de personas ligadas al tango, por continente y por paises; una sección donde pueden visualizarse con mayor detalle, mediante una tabla y un diagrama de barras, los datos recogidos por la aplicación, así como un sistema de filtrado para poder afinar los datos mostrados al ususario; un formulario de inscripción y, finalmente, una sección que muestra la evolución del estado del proyecto mediante una metáfora visual.<br></br>El proceso de inscripción implica la verificación del usuario mediante un correo de confirmación con un enlace a una página en la que encontramos un reCAPTCHA, para dificultar el registro automático por parte de bots.<br></br>Por otro lado, la interfaz de usuario incluye una página con un foro donde cualquiera puede ver los mensajes con las opiniones vertidas por los usuarios registrados.<br></br>El frontal de la aplicación ha sido desplegado en Netlify, haciendo uso de su herramienta de integración y despliegue continuo, a la vez que de un <i>webhook</i> que nos permitirá tenerlo actualizado con los datos que vayaN introduciéndose en la base de datos ligada a la aplicación.<br></br>El <i>back-end</i> está basado en el <i>headless CMS</i> STRAPI, con el que implementamos una API REST y con el que gobernamos el alta y confirmación de ususarios y los mensajes de estos. Los datos se introducen mediante solicitudes POST y PUT a la API, empleando para ello la biblioteca <i>axios</i> de <i>JavaScript</i>&nbsp; y se obtinenen para su visualización en el frontal realizando la correspondiente consulta mediante <i>GraphQl</i>.<br></br>El <i>back-end</i> está desplegado en Heroku y hace uso de un gestor de base de datos PostgreSQL.<br></br>Finalmente, reseñar el uso del servicio de <i>mailing</i> automático de SendGrid para el envío del correo de confirmación.<br></br>Puedes visitar la página en&nbsp;<a href='https://yotambiénamoeltango.com' target='_blank'>yotambiénamoeltango.com</a><br></br>¿BAILÁS? :)"
        },
        {
            "id": 18,
            "postCategory": "Desarrollo Web",
            "postTitle": "VideoHead: La guía definitiva de las mejores películas creada con Gatsby y TMDB REST API",
            "postSubtitle": "WEB APP CON LOS DETALLES DE LAS 50 MEJORES PELÍCULAS DE LA HISTORIA",
            "slug": "videohead-guia-mejores-peliculas",
            "postedOn": "22 de Julio de 2020",
            "author": "GuilleHM",
            "postImage": "videoHead.png",
            "postText": "Aplicación web, con interfaz en inglés, desde la que obtener información de las consideradas como 50 mejores películas de la historia por los integrantes del sindicato de guionistas de Hollywood.<br></br>La aplicación es parte de una prueba técnica que me encargaron en un proceso de selección para un puesto de desarrollador en React.js, empleando este marco de trabajo para el frontal de la aplicación, y que requería obtener los datos desde la API del servicio de datos abiertos <i>The Movie DataBase</i>.&nbsp; Finalmente, opté por basar el proyecto en Gatsby (dado que la cantidad de datos a refrescar es pequeña y ocurre con baja frecuencia), a fin de obtener unos tiempos de carga de las páginas reducidos, que impliquen una mejora en la experiencia de ususario. Asímismo, en esta ocasión he empleado la biblioteca <b><i>Styled Components</i></b>&nbsp; para el estilizado de los componentes.<br></br>Los datos se obtienen mediante llamada a la API, empleando para ello la biblioteca <i>axios</i> de <i>JavaScript</i>&nbsp; y realizando la correspondiente consulta a <b><i>GraphQl</i></b>&nbsp; para hacerlos disponibles en el frontal de la aplicación.<br></br>La interfaz de usuario es muy sencilla, con una primera sección de presentación de la aplicación, seguida de una sección central con las películas más destacadas y una sección final en la que el usuario puede buscar una película determinada u obtener una recomendación aleatoria por parte de la aplicación dentro de las 50 preseleccionadas. Haciendo click en el cartel de cualquiera de las películas, la aplicación nos redirige a una página con los detalles más relevantes de la película, incluyendo un trailer y una serie de enlaces a películas similares.<br></br>Finalmente, el proyecto incluye un <i>script</i>&nbsp; para poder mostrar el testeo automático mediante el uso de la biblioteca <i>Selenium</i>.<br></br>He vuelto a desplegar el sitio web en <i>Netlify</i>&nbsp;, optando por una construcción y despliegue automáticos del sitio e incluyendo las variables del entorno necesarias para la identificación de la aplicación en la API de TMDB (API_KEY y SESSION_ID).<br></br>Puedes visitar la página en&nbsp;<a href='https://videohead.netlify.app' target='_blank'>https://videohead.netlify.app</a>&nbsp;y llegar al repositorio que aloja el código en Github desde el enlace que aparece en la esquina superior derecha de la app.<br></br>¿QUÉ TE APETECE VER? :)"
        },
        {
            "id": 17,
            "postCategory": "Desarrollo Web",
            "postTitle": "Sencilla PWA para comprobar el tiempo en las ciudades españolas",
            "postSubtitle": "APRENDIENDO LAS TÉCNICAS QUE MEJORAN LA EXPERIENCIA DE USUARIO",
            "slug": "pwa-tiempo-ciudades-españolas",
            "postedOn": "20 de Junio de 2020",
            "author": "GuilleHM",
            "postImage": "elTiempoEnTuCiudad.gif",
            "postText": "Esta vez presento una pequeña aplicación para verificar cuál es el tiempo presente en la ciudad española que se elija. Si bien tiene algo de código para proporcionar un estilizado y dinamismo que hagan la aplicación más atractiva, el objetivo fundamental de este desarrollo era crear una Aplicación Web Progresiva (PWA, por sus siglas en inglés).<br></br>Para ser considerada una PWA la aplicación debe cumplir con una serie de criterios definidos y orientados a mejorar la experiencia del ususario de la aplicación como, por ejemplo, su instalabilidad (de forma similar a como podría hacerse en el caso de una aplicación nativa) o el ofrecimiento de una respuesta adecuada en caso de que el dispositivo desde el que se intenta acceder a la aplicación no tenga conexión a internet en ese momento. Para la consecución de tal objetivo, deben emplearse los conocidos como <i>Service Workers</i>, fragmentos de código en <i>JavaScript</i>&nbsp;con peculiaridades como el hecho de que continúan ejecutándose incluso cuando se ha cerrado la sesión de navegación o, incluso, el propio navegador. Como puede verse en la imagen de cabecera de la entrada, la aplicación ha pasado con éxito, tras varios ajustes orientados a cumplir con los requisitos exigidos, la comprobación de <i>Lighthouse</i>&nbsp;, un servicio que sirve para medir el rendimiento y la accesibilidad de los sitios web.<br></br>Se trata de una aplicación creada mediante <i>React.js v.16</i>&nbsp;&nbsp;que consiste, básicamente, en un elemento de entrada de texto donde el usuario puede introducir el nombre de la ciudad y obtener (tormentosa animación mediante :)) varios datos meteorológicos para tal ciudad en ese momento. Los datos se obtienen mediante llamada a la API de <i>Open Weather</i>, empleando para ello la biblioteca <i>axios</i> de <i>JavaScript</i>.<br></br>He vuelto a desplegar el sitio web en <i>Netlify</i>&nbsp;, optando por una construcción y despliegue manual del sitio.<br></br>Puedes visitar la página en&nbsp;<a href='https://eltiempo-ghm.netlify.app' target='_blank'>https://eltiempo-ghm.netlify.app</a>&nbsp; o ver el código del tutorial de Adrian Hadjin en el que está basada la aplicación, en este repositorio de <a href='https://github.com/adrianhajdin/project_weather_pwa' target='_blank'>Github</a>.<br></br>¡MAÑANA VA A HACER LEVANTE! :)"
        },
        {
            "id": 16,
            "postCategory": "Desarrollo Web",
            "postTitle": "Nuevo sitio web creado con Gatsby y Strapi",
            "postSubtitle": "MEJORANDO LA FUNCIONALIDAD Y LA ESTÉTICA DE MI SITIO WEB",
            "slug": "nuevo-sitio-web-gatsby-strapi",
            "postedOn": "17 de Junio de 2020",
            "author": "GuilleHM",
            "postImage": "guillehm.png",
            "postText": "Este nuevo sitio web es un paso más en el camino infinito de aprendizaje que recorre el mundo del desarrollo web (o, para el caso, de cualquier disciplina). Desde el punto de vista funcional, el empleo de un generador de páginas web estáticas como <i>Gatsby</i>&nbsp; pretende mejorar la experiencia de los usuarios que visiten el sitio, ofreciendo menores tiempo de descarga y consumo de ancho de banda, al tratarse de páginas pre-construidas y que emplean técnicas de optimización como la carga perezosa de elementos o imágenes fluidas de tamaño adecuado para el equipo obetivo donde es visualizada la página. En cuanto a la estética, una disposición asimétrica de los elementos y la inclusión de animaciones y otros efectos dinámicos desarrollados con <i>CSS</i> y <i>Javascript</i>, han supuesto un salto de calidad considerable en la apariencia del sitio web.<br></br>Al igual que en la creación de mi propio blob y al tratarse de un sitio creado mediante <i>Gatsby</i>,&nbsp; he utilizado <i>React.js v.16</i>&nbsp;&nbsp;para desarrollar los distintos componentes que conforman el sitio web. En esta ocasión, sin embargo, en lugar de almacenar y extraer los datos de las entradas del blog en varios archivos <i>.json</i>, he decidio utilizar el <i>CMS</i>&nbsp;&nbsp;de <i>Strapi</i>&nbsp;&nbsp;para la gestión y el acceso a tales datos. Cabe reseñar que el <i>CMS</i>&nbsp;&nbsp;de <i>Strapi</i>&nbsp;&nbsp;es muy sencillo de integrar con un sitio web creado mediante un <i>generador de sitios estáticos</i>&nbsp;&nbsp;como <i>Gatsby</i>,&nbsp; muy fácil de aprender a utilizar y completamente libre. Además, no es necesario desplegarlo en ningún servidor externo y puede ejecutarse en un servidor web de desarrollo alojado en la misma máquina en la que se realice el desarrollo del sitio web. Respecto al usuario y la clave de acceso al CMS, he empleado variables del entorno, para desligar estos datos del código.<br></br>He vuelto a desplegar el sitio web en <i>Netlify</i>&nbsp;, aunque optando por una construcción y despliegue manual del sitio.<br></br>Destacar también el redireccionamiento <i>DNS</i>&nbsp;&nbsp;realizado para proporcionar un nombre de dominio libre.<br></br>Como siempre, puedes visitar la página en&nbsp;<a href='https://guillehm.ml' target='_blank'>www.guillehm.ml</a>&nbsp;; el código, sin embargo, no está disponible esta vez en Github pero si estás interesado en él, solo tienes que ponerte en contacto conmigo.<br></br>WELCOME! :)"
        },
        {
            "id": 15,
            "postCategory": "Desarrollo Web",
            "postTitle": "Creando un blog con React.js y el CMS de Netlify",
            "postSubtitle": "UN BLOG PARA LA (IMHO) MEJOR COCINERA DEL UNIVERSO",
            "slug": "blog-carmenmg-con-react-y-el-cms-de-netlify",
            "postedOn": "27 de Mayo de 2020",
            "author": "GuilleHM",
            "postImage": "blogCarmenMG.png",
            "postText": "En esta ocasión, traigo una publicación relativa al blog que he creado y desplegado para que mi madre pueda compartir con el mundo esas recetas con la que lleva toda la vida deleitando los paladares de nuestra familia.<br></br>Al igual que en la creación de mi propio blob, he utilizado <i>React.js v.16</i>&nbsp;&nbsp;para desarrollar el <i>front-end</i>&nbsp;&nbsp;del sitio web. En esta ocasión, sin embargo, en lugar de almacenar y extraer los datos de las entradas del blog en varios archivos <i>.json</i>, he decidio utilizar el <i>CMS</i>&nbsp;&nbsp;de <i>Netlify</i>&nbsp;&nbsp;para la gestión y el acceso a tales datos.<br></br>He vuelto a desplegar el sitio web en <i>Netlify</i>&nbsp;, dada la gran facilidad que ofrece este servicio, no solo para el despliegue inicial del sitio web, sino para la integración continua de nuevos desarrollos.<br></br>Cabe reseñar que el <i>CMS</i>&nbsp;&nbsp;de <i>Netlify</i>&nbsp;&nbsp;es muy sencillo de integrar con un sitio web creado mediante un <i>generador de sitios estáticos</i>&nbsp;&nbsp;(i.e. <i>Gatsby</i>, <i>Hugo</i>, <i>Jekyll</i>, etc.) para lo cual, la documentación del <i>CMS</i>&nbsp;&nbsp;ofrece incluso algunos proyectos preconstruidos; la integración con aplicaciones o sitios web desarrollados mediante marcos de trabajo o bibliotecas especializadas de <i>front-end</i>&nbsp;&nbsp;no es inmediata, pero algunos ajustes en los correspondientes archivos de configuración permite un acople perfecto entre ambas partes.<br></br>Destacar también el redireccionamiento <i>DNS</i>&nbsp;&nbsp;realizado para proporcionar un nombre de dominio libre.<br></br>Como siempre, puedes visitar la página en&nbsp;<a href='https://carmenmg-blog.netlify.app' target='_blank'>www.elblogdecarmenmontado.ml</a>&nbsp;o ver el código fuente en&nbsp;<a href='https://github.com/GuilleHM/blog-carmenmg-react-netlify-cms' target='_blank'>Github</a>.<br></br>¡BUEN PROVECHO! ÑAM :)"
        },
        {
            "id": 14,
            "postCategory": "Desarrollo Web",
            "postTitle": "Mi nuevo blog",
            "postSubtitle": "CREANDO MI BLOG PERSONAL CON REACT.JS",
            "slug": "blog-guillehm-con-react",
            "postedOn": "21 de Mayo de 2020",
            "author": "GuilleHM",
            "postImage": "blogGuilleHM.png",
            "postText": "En esta entrada empleo una técnica muy propia de la programación, la recursividad :), ya que en ella anuncio la publicación de éste, mi nuevo blog.<br></br>Después de varios meses aprendiendo sobre las tecnologías relacionadas con el desarrollo web y empleando, entretanto,&nbsp;<i>Blogger </i>(<i>blogspot</i>) para alojar mi blog y publicar las entradas que he ido creando, ya he alcanzado el nivel de competencia suficiente para dar forma a mi propio blog desde cero.<br></br>Así, utilizando <i>React.js</i> y <i>create-react-app</i>, he desarrollado este  sitio web donde está alojado mi nuevo blog (que mantendrá el mismo nombre y la misma filosofía utilizados en el anterior, aunque con una estética diferente). He desarrollado y desplegado el nuevo sitio web en tan solo unos días, con idea de poder realizar el traslado del blog a la mayor brevedad posible. Es por ello que todavía existen muchos puntos del mismo que requieren optimización, algo que irá ocurriendo progresivamente en las próximas semanas, aprovechando la capacidad de integración continua que ofrece <i>Netlify</i>, el servicio donde está alojado el sitio.<br></br>En una primera instancia, el blog está desarrollado íntegramente en el <i>front-end</i>, guardando los datos necesarios para su presentación en sendos archivos .<i>json</i>. No obstante, en los próximos días integraré el CMS que ofrece Netlify...pero, por ahora, se queda así, que tengo muchas otras cosas en las que trabajar :).<br></br>Puedes visitar la página en...pero, ¡qué digo!, si ya estás aquì :). Bueno, eso sí, el código fuente está disponible, como siempre, en su correspondiente repositorio de <a href='https://github.com/GuilleHM/blog-carmenmg-react-netlify-cms' target='_blank'>Github</a>. Recuerda que puedes utilizarlo y (sobre todo) mejorarlo...si lo haces, por favor, referencia el repositorio o este blog para que siga la cadena de reconocimiento.<br></br>¡BUEN VIAJE! :)"
        },
        {
            "id": 13,
            "postCategory": "Desarrollo Web",
            "postTitle": "Mi Nuevo Sitio Web es (Más) Seguro",
            "postSubtitle": "MEJORANDO LA SEGURIDAD DE MI SITIO WEB",
            "slug": "mi-nuevo-sitio-web-es-mas-seguro",
            "postedOn": "10 de Mayo de 2020",
            "author": "GuilleHM",
            "postImage": "sitioWebSeguro.png",
            "postText": "Aunque éste ya ofrecía un estándar de seguridad elevado, toda vez que se sirve a través de HTTPS (el sitio web está alojado en Netlify, que dota por defecto del certificado de autentificación necesario para ello). No obstante, siempre hay lugar para la mejora: un par de pequeños cambios han implicado un avance sustancial en la categoría alcanzada por el sitio web en la herramienta para la evaluación de la seguridad de sitios web que ofrece Mozilla.<br></br>En <a href='https://observatory.mozilla.org/analyze/guille.ml' target='_blank'>https://observatory.mozilla.org/analyze/guille.ml</a> puedes encontrar los resultado completos de la evaluación.<br></br>La modificación ha consistido, básicamente, en la inclusión en el archivo de configuración empleado para el despliegue automático del sitio web en Netlify (netlify.toml), del código necesario para la actualización de la respuesta HTTP del servidor, de forma que ésta incluya una CSP o Política de Seguridad del Contenido (con unas directivas determinadas) y sendos encabezados relativos a otros aspectos relacionados con la seguridad (si estás interesado/-a en los detalles técnicos, no dudes en contactarme).<br></br>Otro tema muy distinto es el rendimiento...y ese lo abordaré pronto, empleando, por ejemplo, <i>responsive images</i> (<i>resolution switching</i>&nbsp;&nbsp;y/o <i>art direction</i>&nbsp;): una técnica que implica adaptar el 'peso' de las imágenes empleadas en las distintas páginas que componen el sitio, a los distintos dispositivos desde los que se puede acceder a ellas...<i>stay tuned!</i><br></br>¡QUE TENGAS UNA NAVEGACIÓN SEGURA! :)"
        },
        {
            "id": 12,
            "postCategory": "Desarrollo Web",
            "postTitle": "Página de Inicio con Efecto de Escritura Dinámica",
            "postSubtitle": "UNA FORMA ORIGINAL DE PRESENTAR UN SITIO WEB",
            "slug": "pagina-inicio-efecto-escritura-dinamica",
            "postedOn": "6 de Mayo de 2020",
            "author": "GuilleHM",
            "postImage": "bienvenidoAMiSitioWeb2.gif",
            "postText": "Ésta es una entrada concisa para mostrar una página de inicio desplegada manualmente en Netlify.<br></br>Utilizando el efecto que simula la escritura de caracteres en pantalla (ya empleado anteriormente en EL TEMPLE), presento esta página de inicio que he utilizado para familiarizarme con el proceso de despliegue de sitios web estáticos en Netlify.<br></br>El siguiente paso consistirá en aprovechar la posibilidad de despliegue / integración continua (CD/CI) que ofrece Netlify, integrando un repositorio publicado en Github para ello.<br></br>Puedes visitar la página en&nbsp;<a href='https://ghm-landingpage-test.netlify.app/' target='_blank'>https://ghm-landingpage-test.netlify.app</a>&nbsp;o ver el código fuente en&nbsp;<a href='https://github.com/GuilleHM/despliegue-manual-landingpage-netlify' target='_blank'>Github</a>.<br></br>¡SALUDOS DESDE ESTA BONITA NOCHE!"
        },
        {
            "id": 11,
            "postCategory": "Desarrollo Web",
            "postTitle": "Pelotas que Rebotan, Aparecen, Desaparecen y Cambian de Color y Tamaño",
            "postSubtitle": "PELOTAS 'BOTIBOIN'",
            "slug": "pelotas-botiboing",
            "postedOn": "29 de Abril de 2020",
            "author": "GuilleHM",
            "postImage": "pelotasBotiboing.gif",
            "postText": "En esta ocasión traigo el resultado de un ejercicio planteado en la web de la <i>Mozilla Development Network</i>: una pantalla con pelotas de colores que rebotan contra las paredes del navegador web.<br></br>He incluido varias modificaciones para personalizar el resultado final del proyecto: un fondo y una cabecera distintas, las pelotas no incluyen estela y en caso de colisión aparecen/desaparecen y cambian de tamaño y color.<br></br>Este mini proyecto tiene como objetivo fundamental practicar el uso del <u>modelo de clases para la definición de objetos</u> (en lugar del menos intuitivo modelo basado en funciones constructoras y prototipos), introducido en la especificación del lenguaje <i>JavaScript </i>&nbsp;ECMAScript2015 (a.k.a. ES6), y la <u>API Canvas</u> para la representación de figuras 2D.<br></br>A continuación, puedes ver un GIF extraído del resultado final. Si visitas la web&nbsp;<a href='https://guillehm.github.io/pelotas-botiboin/' target='_blank'>https://guillehm.github.io/pelotas-botiboin/</a>&nbsp;podrás ver a estas bolas juguetonas en todo su esplendor. El código, como siempre, en <a href='https://github.com/GuilleHM/pelotas-botiboin' target='_blank'>Github</a>.<br></br>BOING, BOING... :)"
        },
        {
            "id": 10,
            "postCategory": "Desarrollo Web",
            "postTitle": "Un Formulario Web Peculiar",
            "postSubtitle": "QUERIDO X, ¿CÓMO ESTÁS?",
            "slug": "un-formulario-web-peculiar",
            "postedOn": "23 de Abril de 2020",
            "author": "GuilleHM",
            "postImage": "postcardSnapshot4.png",
            "postText": "Esta publicación muestra un formulario web que simula el reverso de una tarjeta postal.<br></br>Se trata de un pequeño proyecto basado en la sección de aprendizaje&nbsp;del sitio web&nbsp;<i>Mozilla Development Network</i>&nbsp;sobre el empleo y estilizado de varios de los tipos de elementos de control que pueden conformar un formulario.<br></br>El formulario se presenta sobre una imagen de fondo de una postal e incluye un área de texto donde escribir un mensaje, dos entradas de línea de texto en las que indicar, respectivamente, el nombre y el correo electrónico del remitente y un botón sobre el que clicar para enviar el formulario (el botón está inactivo, ya que el el formulario no pretende ser funcional).<br></br>Cabe destacar que la entrada de correo electrónico hace uso de la verificación del lado cliente por defecto del navegador para asegurar la entrada de una dirección con un formato correcto. Respecto al estilizado, reseñar que se emplean dos tipos de fuentes para el texto: una que imita la escritura mediante una máquina de escribir antigua y otra que hace lo propio para un texto escrito a mano.<br></br>Puedes visitar el formulario en&nbsp;<a href='https://guillehm.github.io/formulario-web-tarjeta-postal/' target='_blank'>https://guillehm.github.io/formulario-web-tarjeta-postal/</a>&nbsp;o ver el código fuente en&nbsp;<a href='https://github.com/GuilleHM/formulario-web-tarjeta-postal' target='_blank'>Github</a>.<br></br>¿DESDE DÓNDE VAS A ENVIAR TU POSTAL? :)"
        },
        {
            "id": 9,
            "postCategory": "Desarrollo Web",
            "postTitle": "El Temple",
            "postSubtitle": "PÁGINA DE INICIO DE UN SITIO WEB MISTERIOSO",
            "slug": "el-temple",
            "postedOn": "21 de Abril de 2020",
            "author": "GuilleHM",
            "postImage": "elTemple.png",
            "postText": "En esta entrada presento una página de inicio adaptativa (<i>responsive&nbsp;landing page</i>&nbsp;) de un sitio web que he creado para la práctica de <i>html5</i>, <i>css3</i>&nbsp;(incluyendo <i>media queries </i>y<i> keyframes</i>&nbsp;) y <i>javascript</i>.<br></br>Por otro lado, el uso de <i>npm </i>y <i>gh-pages</i>, ha permitido el despliegue del 'sitio' web, al que se accede mediante redireccionamiento DNS, en GitHub Pages.<br></br>En definitiva, una suerte de ejercicio para practicar la creación del <i>front-end</i> y el despliegue de un sitio web.<br></br>Puedes visitarla en&nbsp;<a href='https://eltemple.tk/' target='_blank'>www.eltemple.tk</a>&nbsp;o ver el código fuente en <a href='https://github.com/GuilleHM/eltemple' target='_blank'>Github</a>.<br></br>PD: si accedes mediante ordenador, en lugar de tableta o teléfono inteligente, la experiencia será mucho más rica, incluyendo efectos sonoros y una sorpresa dentro de la torre :).<br></br>¿TE ATREVES A ENTRAR?"
        },
        {
            "id": 8,
            "postCategory": "Desarrollo Web",
            "postTitle": "Mi Nuevo Sitio Web",
            "postSubtitle": "NUEVA WEB PERSONAL CON ANIMACIONES CSS3",
            "slug": "mi-nuevo-sitio-web",
            "postedOn": "22 de Marzo de 2020",
            "author": "GuilleHM",
            "postImage": "nuevoSitioWeb.png",
            "postText": "Ésta es una entrada singular...sólo pretende anunciar el lanzamiento de mi nuevo sitio web. Si quieres visitarlo, puedes hacerlo en <a href='https://www.guille.ml/' target='_blank'>www.guille.ml</a>.<br></br>¡AH! SE ME OLVIDABA, ESTÁ EN INGLÉS :)"
        },
        {
            "id": 7,
            "postCategory": "Desarrollo Web",
            "postTitle": "Mi Primera Nano-Aplicación Flask",
            "postSubtitle": "¿NANO O PICO? NO SÉ...¡MUY PEQUEÑA EN CUALQUIER CASO!",
            "slug": "mi-primera-nano-aplicacion-flask",
            "postedOn": "26 de Febrero de 2020",
            "author": "GuilleHM",
            "postImage": "techTestAapp.png",
            "postText": "Esta entrada recoge el trabajo realizado para una prueba técnica en la que se solicita el uso de diversas herramientas empleadas en el desarrollo de aplicaciones web:<ul><li>Python, como lenguaje de programación base en el<i> back-end</i>.</li><li>Flask, un <i>micro-framework</i> para Python empleado en <i>web development</i>.</li><li>Unittest, un módulo de la biblioteca estándar de Python para el testeado de aplicaciones.</li><li>Git and Github, un sistema de control de versiones y un repositorio remoto, respectivamente, que sirven para la sincronización del trabajo de un grupo de desarrolladores de <i>software</i>.</li></ul>El proyecto implicaba el desarrollo de una 'aplicación' (el entrecomillado pretende resaltar el hecho de que se trata una prueba y no una aplicación real) web que sirviese para almacenar fotos y poder recuperarlas con posterioridad.<br></br>A parte de las herramientas mencionadas arriba, el uso de Visual Studio Code, con la nueva integración de <i>Kite,&nbsp;</i>para la corrección de código, ha facilitado mucho el desarrollo de la aplicación.<br></br>Reseñar, finalmente, el uso de un entorno virtual de conda para la organización de las dependencias necesarias para el correcto funcionamiento de la aplicación.<br></br>Puedes descargar el código y los archivos necesarios en el correspondiente repositorio de&nbsp;<a href='https://github.com/GuilleHM/TechTest' target='_blank'>GitHub</a>. Siéntete libre de mejorarlo y/o utilizarlo. Si lo haces, recuerda mencionar esta entrada para que la cadena de reconocimientos siga su curso.<br></br>DESARROLLO WEB...¡ALLÁ VOY!"
        },
        {
            "id": 6,
            "postCategory": "Inteligencia Artificial",
            "postTitle": "De Incógnito",
            "postSubtitle": "EMPLEANDO OPENCV PARA RECONOCER CARAS...¡Y DISFRAZARLAS!",
            "slug": "de-incognito",
            "postedOn": "21 de Febrero de 2020",
            "author": "GuilleHM",
            "postImage": "deIncognitoConMarcaDeAgua.png",
            "postText": "Los carnavales están a la vuelta de la esquina, así que he aprovechado para publicar este pequeño proyecto de <i>Computer Vision</i> en Python.<br></br>El objetivo de este trabajo era familiarizarme con la biblioteca <b>OpenCV </b>de Python. Dentro de las amplias opciones que ofrece esta potente herramienta para el procesamiento de imágenes, decidí centrarme en el reconocimiento facial y la superposición de imágenes para conseguir un efecto (carnavalesco) de camuflaje.<br></br>El proyecto está basado en una idea de <a href='https://www.codingforentrepreneurs.com/' target='_blank'>codingforenterpreneurs</a>, aunque emplea un algoritmo distinto para el solapamiento de imágenes.<br></br>La idea básica es la siguiente: utilizar <b>OpenCV </b>para grabar un video a través de una <i>webcam</i>, reconocer la cara que aparezca en el video (este trabajo está limitado a una cara, aunque es fácilmente ampliable a imágenes en las que aparezcan varias caras) y colocar sobre la misma una serie de imágenes predefinidas (en este caso, un sombrero de copa y unas gafas de sol negras). Para la superposición de imágenes emplea el canal de transparencia de las imágenes tipo PNG.<br></br>Por otro lado, y para completar el proyecto, un pequeño <i>script</i>, también basado en <b>OpenCV</b>, sirve para introducir la marca de agua que puede verse en la esquina superior derecha del fotograma,&nbsp; (extraído del vídeo que se muestra a continuación) que aparece como cabecera de esta publicación.<br></br>A continuación, uno de los vídeos grabados mediante el <i>script </i>principal, GafasyGorro.py. Puede observarse cómo el sistema deja de reconocer la cara como tal cuando ponemos una mano delante de la misma.<br></br>Puedes descargar el código y los archivos necesarios en el correspondiente repositorio de&nbsp;<a href='https://github.com/GuilleHM/Incognito' target='_blank'>GitHub</a>. Siéntete libre de mejorarlo y/o utilizarlo. Si lo haces, recuerda mencionar esta entrada para que la cadena de reconocimientos siga su curso.<br></br>POR CIERTO...¡EL QUE APARECE EN LA IMAGEN NO SOY YO! :)"
        },
        {
            "id": 5,
            "postCategory": "Ingeniería del Software",
            "postTitle": "¡Ya Vienen Los Reyes!",
            "postSubtitle": "CÓMO UTILIZAR LA MULTITAREA ASÍNCRONA COOPERATIVA EN PYTHON",
            "slug": "ya-vienen-los-reyes",
            "postedOn": "2 de Enero de 2020",
            "author": "GuilleHM",
            "postImage": "reyesMagos.gif",
            "postText": "Si el subtitulo de esta entrada te suena a chino, no te preocupes...¡es <i>normal</i>! Le sucede a la mayoría de la gente <i>normal </i>:)<br></br>En esta publicación puedes ver una representación un tanto peculiar de la Llegada de los Reyes Magos al Portal de Belén, un tema muy apropiado para la época.<br></br>Ésta es una creación artístico-técnica en la que emplearemos como base una ilustración creada a partir de un dibujo publicado por <i>Andrew Newman</i> en <a href='https://www.asciiart.eu/holiday-and-events/christmas/religious' target='_blank'>ASCII Arts</a> y a la que añadiremos dinamismo a través del cambio de color y el parpadeo de algunos elementos, lo que nos servirá para practicar el <b>procesamiento cooperativo asíncrono multitarea en Python</b>. La idea está inspirada en el mini proyecto de <i>Engineer Man</i> para la creación de un arbol de Navidad que podemos encontrar en <a href='https://github.com/engineer-man/youtube/tree/master/089' target='_blank'>Github</a>.<br></br>Puedes descargar el <i>notebook</i>&nbsp;(junto con sus versiones en .html y .pdf) de este proyecto en el siguiente&nbsp;<a href='https://drive.google.com/drive/folders/1eT0iUGT7eZ6_09usxwCA_Feb5iVY0LVw?usp=sharing' target='_blank'>enlace</a>. Si lo prefieres, puedes consultar el código y los archivos necesarios en el correspondiente repositorio de <a href='https://github.com/GuilleHM/Reyes-Magos-2020' target='_blank'>GitHub</a>. Siéntete libre de mejorarlo y/o utilizarlo. Si lo haces, recuerda mencionar esta entrada para que la cadena de reconocimientos siga su curso.<br></br>¡ESPERO QUE NO ME TRAIGAN CARBÓN! :)"
        },
        {
            "id": 4,
            "postCategory": "Inteligencia Artificial",
            "postTitle": "JOBNTER no te Quitará el Trabajo, ¡Te Ayudará a Encontrarlo!",
            "postSubtitle": "CÓMO APLICAR A CIENTOS DE TRABAJOS...¡Y NO MORIR EN EL INTENTO!",
            "slug": "jobnter",
            "postedOn": "7 de Diciembre de 2019",
            "author": "GuilleHM",
            "postImage": "jobnter.png",
            "postText": "Si estás buscando trabajo actualmente, utilizas&nbsp;<a href='http://www.linkedin.com/' target='_blank'>LinkedIn</a>&nbsp;para ello y te gustaría contar con un asistente personal que envíe por tí tus solicitudes, esta entrada te interesa.<br></br>Tras finalizar mi Máster en Análisis y Visualización de Datos Masivos (<i>Big Data</i>) el pasado mes de Noviembre, comencé a buscar trabajo para reorientar mi carrera profesional hacia el mundo de la Ciencia de los Datos.<br></br>La buena noticia es que en la web de <i>LinkedIn</i>&nbsp;existen (mientras escribo estas líneas) más de 22.000 puestos abiertos en la Unión Europea relacionados con esta orientación laboral. La mala, sin embargo, es que surcar ese vasto elenco de oportunidades es una tarea <i>muuuuy </i>cansina <i>y&nbsp;</i>estresante. Leer la descripción del trabajo, los requisitos para el puesto, informarse sobre la empresa, enviar la solicitud...y así, una y otra vez.<br></br><i>LinkedIn</i> muestra para cada puesto de trabajo publicado en su web, el número de personas que lo han solicitado. Algunos de ellos cuentan con cientos de solicitantes y, obviamente, los reclutadores de las empresas NO revisan los perfiles y/o Cv's de todas las personas que aplican a dichos puestos. Dado el gran número de solicitudes que reciben, muchas de estas empresas han implantado algoritmos de procesado que sirven para filtrar todas estas solicitudes en base a una serie de criterios bien definidos.<br></br>Es perfectamente legítimo que las empresas empleen este tipo de técnicas para optimizar sus recursos. Igualmente, creo que los candidatos debemos emplear nuestro tiempo en tareas más provechosas, como incrementar nuestra formación, en lugar de realizar la repetitiva y tediosa tarea que supone enviar solicitudes de empleo, máxime cuando puede que nadie llegue a revisar finalmente nuestra solicitud. Para este tipo de tareas también nosotros debemos apoyarnos en las máquinas.<br></br>Tras reflexionar sobre todos los detalles del proceso de búsqueda de empleo en <i>LinkedIn</i>, decidí crear un <i>bot</i>&nbsp;que aplicase programáticamente por mi a aquellos puestos de mi interés. Solo si se producía entonces un <i>match </i>en este 'Tinder del Trabajo', una persona al otro lado y yo, dedicaríamos nuestro tiempo en dilucidar si podríamos llegar a establecer una relación estable (esta parte no me ha quedado muy romántica, ¿no? :)).<br></br>La opción de 'Solicitud sencilla', que permite reducir el proceso de solicitud a un par de <i>clicks</i>&nbsp;de ratón (aunque es cierto que el número de puestos accesibles a través de esta opción es sensiblemente menor), es perfecta para el objetivo de automatizar la búsqueda de empleo: un <i>script </i>en Python empleando las librerías&nbsp;<i>Selenium y BeautifulSoup, y</i>&nbsp;ejecutado periódicamente, sería el encargado.<br></br>La pertinente búsqueda en La Web para ver si alguien había tenido ya esta idea, me llevó a descubrir en GitHub este fabuloso&nbsp;<a href='https://github.com/nicolomantini/LinkedIn-Easy-Apply-Bot' target='_blank'>proyecto</a>&nbsp;de Nicolò Mantini. La optimización y adaptación a mis necesidades de su código, llevó a la creación de mi <i>querido </i>asistente personal para la búsqueda de trabajo: <b>JOBNTER</b>.<br></br>Ya he puesto a trabajar a JOBNTER, con más de 50 solicitudes enviadas con éxito. En los próximos días lo pondré a funcionar a pleno rendimiento y actualizaré la entrada con los resultados.<br></br>ACTUALIZACIÓN (Mayo 2020): JOBNTER funciona perfectamente con, literalmente, miles de CVs enviados. Desafortunadamente, todavía no ha habido <i>match</i>...Pero, ¡seguimos intentándolo!.<br></br>Puedes encontrar el código de este proyecto en el siguiente <a href='https://github.com/GuilleHM/JOBNTER' target='_blank'>enlace</a> (¡ya está publicado!). Siéntete libre de mejorarlo y/o utilizarlo. Si lo haces, recuerda mencionar esta entrada para que la cadena de&nbsp; reconocimientos siga su curso.<br></br>¡SUERTE EN TU BÚSQUEDA!<br></br>NOTA: La estética de JOBNTER está basada en Chomper, un simpático robot quitanieves diseñado y construido por Dane Kouttron, ingeniero del MIT. Me pareció acertado emplearlo como modelo ya que ambos hacen lo mismo: ¡te abren el camino! Puedes ver un video de Chomper en acción en este <a href='https://vimeo.com/260872599' target='_blank'>enlace</a>."
        },
        {
            "id": 3,
            "postCategory": "Ingeniería Energética / Ciencia de los Datos",
            "postTitle": "Estudio de Viabilidad de una Instalación de Autoconsumo Conectada a Red",
            "postSubtitle": "TRABAJO FIN DE MÁSTER - Análisis y Visualización de Datos Masivos (Big Data) ",
            "slug": "estudio-viabilidad-instalacion-autoconsumo",
            "postedOn": "4 de Diciembre de 2019",
            "author": "GuilleHM",
            "postImage": "alternativeEnergy.jpg",
            "postText": "Esta publicación recoge un resumen y el enlace a mi TFM.<br></br>El trabajo ha evaluado la viabilidad económica de una instalación eólico-solar de autoconsumo de energía eléctrica para un domicilio particular, en el nuevo contexto que ha supuesto para este tipo de instalaciones la reciente aprobación en España del Real Decreto 244/2019, de 5 de abril.<br></br>El empleo de tecnologías como PowerShell, MongoDB, R y Python nos ha permitido la recolección (desde fuentes de datos abiertas de reconocida fiabilidad como son AEMET OpenDanta, PVGIS, ERA-Interim, REE eSIOS, etc.), el almacenamiento, la manipulación, el análisis y la visualización de los datos relativos a: los recursos eólico y solar disponibles en el domicilio, los patrones de consumo de energía eléctrica en éste, el precio de la energía (tanto consumida como producida) y los costes de la instalación.<br></br>La conjugación de dichos datos ha revelado la idoneidad en este caso de una instalación meramente solar. Estos mismos datos indican, no obstante, que una instalación eólica o híbrida puede ser también una opción económicamente viable.<br></br>Puedes encontrar la memoria del TFM en el siguiente <a href='https://drive.google.com/drive/folders/1SgEUGdC8Y5dfOTnFP2My76e1F_vykOg3' target='_blank'>enlace</a>.<br></br>¡PÁSATE A LAS ENERGÍAS LIMPIAS!"
        },
        {
            "id": 2,
            "postCategory": "Visualización de Datos",
            "postTitle": "Homenaje al 'Capitán Veneno'",
            "postSubtitle": "UN ESCULTOR DE LA PALABRA Y EL JUICIO CRÍTICO",
            "slug": "homenaje-al-capitan-veneno",
            "postedOn": "1 de Diciembre de 2019",
            "author": "GuilleHM",
            "postImage": "capitanVeneno.png",
            "postText": "El objetivo de esta publicación es rendir un homenaje póstumo a <b>Juan Carlos Aragón</b>, 'El Capitán Veneno': poeta, filósofo y reconocido autor de chirigotas y comparsas del Carnaval de Cádiz. Para ello, programamos un <i>web crawler</i> que obtiene las letras de sus agrupaciones carnavalescas más famosas y, desde éstas, creamos una NUBE DE PALABRAS que nos muestra qué palabras aparecen con mayor frecuencia en sus repertorios.<br></br>Puedes encontrar la publicación completa, en formatos <i>html </i>y <i>pdf</i>,&nbsp;en el siguiente <a href='https://drive.google.com/drive/folders/13DriaeeQyvXhtzR4VkwFauDRjr7OuluW?usp=sharing' target='_blank'>enlace</a>.<br></br>Para realizar esta nube de palabras, hemos utilizado las letras de sus agrupaciones desde 1997 hasta 2018 (cuatro chirigotas y veinte comparsas en total).<br></br>Como podemos observar en la visualización anterior, las palabras que más empleó el autor como letrista de estas agrupaciones carnavalescas, son:<ul><li><b>CÁDIZ</b></li><li><b>VIDA</b></li><li><b>GENTE</b></li><li><b>AQUÍ</b> (¿tendrá algo que ver con 'algo que hay que hacer' en Cádiz?<span style='font-size: x-small;'> - pequeña licencia&nbsp;humorística :) -</span>)</li><li><b>DÍA</b></li></ul>Además, podemos apreciar otras palabras con una frecuencia de aparición algo menor pero que, a título personal, me 'saben' mucho a JCA.<br></br>A los aficionados del Carnaval de Cádiz, ¿qué os parece que sean éstas las palabras más usadas por el tristemente desaparecido autor? ¿Os ha sorprendido? ¡Dejad vuestros comentarios!<br></br>DEP, MAESTRO."
        },
        {
            "id": 1,
            "postCategory": "Visualización de Datos",
            "postTitle": "8500: ¿En Cuánto Tiempo Morirían Nuestros Hijos?",
            "postSubtitle": "LA DESNUTRICIÓN COMO CAUSA EVITABLE DE MORTALIDAD INFANTIL",
            "slug": "8500-en-cuanto-tiempo-moririan-nuestros-hijos",
            "postedOn": "26 de Noviembre de 2019",
            "author": "GuilleHM",
            "postImage": "mapa8500.gif",
            "postText": "Según estimaciones de la ONG&nbsp;<a href='https://www.accioncontraelhambre.org/es/landing/8500-ninos-mueren-cada-dia-por-desnutricion' target='_blank'>ACCIÓN CONTRA EL HAMBRE</a>,&nbsp;<b>8500 niños menores de 5 años mueren AL DÍA por desnutrición</b>.<br></br>El objetivo de esta publicación es crear un mapa dinámico que muestre cuánto tiempo tardarían en morir todos los niños menores de 5 años en España, en caso de sufrir en nuestro pais esta mortandad. Éste es, obviamente, un ejercicio figurativo, con la única finalidad de facilitar la comprensión por parte de la problación española del alcance de esta tragedia global. Para ello, empleamos una metáfora visual en la que la luz del pais se iría apangando a medida que muriesen los niños.<br></br>Para intentar dar un contexto y hacer más comprensible la magnitud de esta tragedia, baste con decir que, si fuesen los aproximadamente 2 millones de niños españoles lo que murieses a ese ritmo, estos <b>MORIRÍAN EN MENOS DE 9 MESES</b>.<br></br>Puedes encontrar la publicación completa, incluído el código para generar la visualización, en los siguientes enlaces: <a href='http://rpubs.com/GuilleHM/552789' target='_blank'>FondoClaro</a> y <a href='http://rpubs.com/GuilleHM/553928' target='_blank'>FondoOscuro</a>.<br></br><b>ACTUALIZACIÓN DE LA PUBLICACIÓN EN MAYO DE 2020: En estos tiempos en los que 'la sociedad' (vaya concepto rancio) se escandaliza por los miles de muertos a causa de la COVID-19, deberíamos avengonzarnos de este otro número, 8500, muchísimo más devastador: a día de hoy hay en el mundo unas 200.000 personas fallecidas por la COVID-19 (DEP); esa misma cantidad de niños menores de 5 años mueren por problemas derivados de la malnutrición CONTINUAMENTE cada, aproximadamente, 24 días</b>."
        }
    ]
}